src/Documents/ИТСервисы_УтверждениеДокументации/ИТСервисы_УтверждениеДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_УтверждениеДокументации</name>
  <registerRecords>InformationRegister.ИТСервисы_ПараметрыИТСервисов</registerRecords>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
      <types>CatalogRef.ИТСервисы_ПрограммныеОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументацияСервиса</name>
    <attributes>
      <name>ТипДокументации</name>
      <type>
        <types>CatalogRef.ИТСервисы_ТипыДокументации</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ИТСервисы_СтатусыДокументации</types>
      </type>
    </attributes>
    <attributes>
      <name>АвторДокумента</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_ПараметрыИТСервисов/ИТСервисы_ПараметрыИТСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_ПараметрыИТСервисов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НаРазвитии</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НаСопровождении</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПланПроектаВИСУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КодВАРМРазработчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДорожнаяКарта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриказОВводеВПЭ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПаспортСервиса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Архитектура</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БазаЗнаний</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорТП</name>
    <type>
      <types>Boolean</types>
      <types>DocumentRef.ИТСервисы_ДоговорСТехническимПровайдером</types>
    </type>
  </resources>
  <resources>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ИТСервисы_ТипыДокументации/ИТСервисы_ТипыДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_ТипыДокументации</name>
  <predefined>
    <items>
      <name>Архитектура</name>
      <description>Архитектура</description>
    </items>
    <items>
      <name>БазаЗнаний</name>
      <description>База знаний</description>
    </items>
    <items>
      <name>ПаспортИТСервиса</name>
      <description>Паспорт ИТ-Сервиса</description>
    </items>
    <items>
      <name>ДорожнаяКарта</name>
      <description>Дорожная карта развития</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательнаяДокументация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/ИТСервисы_УтверждениеДокументации/ObjectModule.bsl
#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	Если НЕ ЗначениеЗаполнено(Предмет) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не указан предмет документирования (ИТ-Сервис, Проект или ПО)!", 
			"Предмет", 
			"Предмет", 
			Отказ
		);
		Возврат;
	КонецЕсли;

	Если ТипЗнч(Предмет) = Тип("СправочникСсылка.ИТСервисы_ИТСервисы") Тогда
		Движения.ИТСервисы_ПараметрыИТСервисов.Записывать = Истина;
		Движения.ИТСервисы_ПараметрыИТСервисов.Очистить();
		ЗаписатьДвиженияПоПараметрамСервиса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьДвиженияПоПараметрамСервиса()
	ПредыдущееСостояние = ПолучитьПредыдущееСостояниеПараметров();
	
	ЗаписьПараметров = Движения.ИТСервисы_ПараметрыИТСервисов.Добавить();
	ЗаписьПараметров.Период = Дата;
	ЗаписьПараметров.Проект = Предмет;
	
	ЗаполнитьЗначенияСвойств(ЗаписьПараметров, ПредыдущееСостояние);
	
	ЗаписьПараметров.ДорожнаяКарта = Ложь;
	ЗаписьПараметров.ПаспортСервиса = Ложь;
	ЗаписьПараметров.Архитектура = Ложь;
	ЗаписьПараметров.БазаЗнаний = Ложь;
	
	Для Каждого СтрокаТЧ Из ДокументацияСервиса Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ТипДокументации) Тогда
			Продолжить;
		КонецЕсли;
		
		Тип = СтрокаТЧ.ТипДокументации;
		
		Если Тип = Справочники.ИТСервисы_ТипыДокументации.ДорожнаяКарта Тогда
			ЗаписьПараметров.ДорожнаяКарта = Истина;
		ИначеЕсли Тип = Справочники.ИТСервисы_ТипыДокументации.ПаспортИТСервиса Тогда
			ЗаписьПараметров.ПаспортСервиса = Истина;
		ИначеЕсли Тип = Справочники.ИТСервисы_ТипыДокументации.Архитектура Тогда
			ЗаписьПараметров.Архитектура = Истина;
		ИначеЕсли Тип = Справочники.ИТСервисы_ТипыДокументации.БазаЗнаний Тогда
			ЗаписьПараметров.БазаЗнаний = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПредыдущееСостояниеПараметров()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыСрезПоследних.ДорожнаяКарта КАК ДорожнаяКарта,
	|	ПараметрыСрезПоследних.ПаспортСервиса КАК ПаспортСервиса,
	|	ПараметрыСрезПоследних.Архитектура КАК Архитектура,
	|	ПараметрыСрезПоследних.БазаЗнаний КАК БазаЗнаний,
	|	ПараметрыСрезПоследних.ПриказОВводеВПЭ КАК ПриказОВводеВПЭ,
	|	ПараметрыСрезПоследних.ДоговорТП КАК ДоговорТП
	|ИЗ
	|	РегистрСведений.ИТСервисы_ПараметрыИТСервисов.СрезПоследних(&МоментДо, Проект = &Проект) КАК ПараметрыСрезПоследних
	|УПОРЯДОЧИТЬ ПО
	|	ПараметрыСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Проект", Предмет);
	Запрос.УстановитьПараметр("МоментДо", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Состояние = Новый Структура;
	Состояние.Вставить("ДорожнаяКарта", Ложь);
	Состояние.Вставить("ПаспортСервиса", Ложь);
	Состояние.Вставить("Архитектура", Ложь);
	Состояние.Вставить("БазаЗнаний", Ложь);
	Состояние.Вставить("ПриказОВводеВПЭ", Неопределено);
	Состояние.Вставить("ДоговорТП", Неопределено);
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Состояние, Выборка);
	КонецЕсли;
	
	Возврат Состояние;
	
КонецФункции

#КонецОбласти

#Область ПроверкаЗаполнения

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(Предмет) И ПроверяемыеРеквизиты.Содержит("Предмет") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не указан предмет документирования!";
		Сообщение.Поле = "Предмет";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если ДокументацияСервиса.Количество() = 0 И ПроверяемыеРеквизиты.Содержит("ДокументацияСервиса") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена табличная часть 'Документация'!";
		Сообщение.Поле = "ДокументацияСервиса";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	ПроверитьОбязательнуюДокументацию(Отказ);
	
КонецПроцедуры

Процедура ПроверитьОбязательнуюДокументацию(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИТСервисы_ТипыДокументации.Ссылка КАК Ссылка,
	|	ИТСервисы_ТипыДокументации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИТСервисы_ТипыДокументации КАК ИТСервисы_ТипыДокументации
	|ГДЕ
	|	ИТСервисы_ТипыДокументации.ОбязательнаяДокументация = ИСТИНА";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ДокументацияСервиса.НайтиСтроки(
			Новый Структура("ТипДокументации", Выборка.Ссылка)
		);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			ТекстСообщения = СтрШаблон(
				"Обязательно должен быть зарегистрирован документ типа '%1'!",
				Выборка.Наименование
			);
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстСообщения;
			Сообщение.Поле = "ДокументацияСервиса";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
